anapopescu-beep/audi_sandbox/Tools/EB_BSW_8.8.7/Workspace/plugins/McalExt_TS_T40DxM1I0R0/MCAL_Delivery/eclipse/plugins/Fls_TS_T40D2M10I1R0/examples/S32DS/Ftfc_Ip_Example_S32K148/src/main.c
/*
*   (c) Copyright 2020 NXP
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be used strictly
*   in accordance with the applicable license terms.  By expressly accepting
*   such terms or by downloading, installing, activating and/or otherwise using
*   the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms.  If you do not agree to
*   be bound by the applicable license terms, then you may not retain,
*   install, activate or otherwise use the software.
*
*   This file contains sample code only. It is not part of the production code deliverables.
*/

#ifdef __cplusplus
extern "C" {
#endif


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "S32K148_LMEM.h"
#include "sys_init.h"
#include "Ftfc_Fls_Ip.h"

#include "check_example.h"

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/


/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/
/* Test the last sector of P_FLASH: FLS_CODE_ARRAY_0_BLOCK_2_S383 */
#define FTFC_SECTOR_ADDR             (FTFC_P_FLASH_BASE_ADDR + 0x17F000UL)

/* Address offset = 16 bytes */
#define FTFC_WRITE_ADDR              (FTFC_SECTOR_ADDR + 16U)

/* Test data size (must be double word aligned) */
#define FTFC_BUF_SIZE                (64U)

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/


/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/


/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
uint8 TxBuffer[FTFC_BUF_SIZE];
uint8 RxBuffer[FTFC_BUF_SIZE];

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
static void Fls_ExampleAssert(boolean Condition);
static void Fls_InitBuffers(void);
static boolean Fls_VerifyBuffers(void);
static void Fls_CacheSetup(void);

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

/**
 * @brief Implement a simple assert macro
 *
 * @param Condition
 * @return void
 */
static void Fls_ExampleAssert(boolean Condition)
{
    if (!Condition)
    {
        for(;;)
        {
            /* Loop forever */
        }
    }
}

static void Fls_InitBuffers(void)
{
    uint32 Index;

    /* Initialize data to default value */
    for (Index = 0U; Index < FTFC_BUF_SIZE; Index++)
    {
        TxBuffer[Index] = (uint8)Index;
        RxBuffer[Index] = 0U;
    }
}

static boolean Fls_VerifyBuffers(void)
{
    uint32 Index;

    for (Index = 0U; Index < FTFC_BUF_SIZE; Index++)
    {
        if (RxBuffer[Index] != TxBuffer[Index])
        {
            return FALSE;
        }
    }
    return TRUE;
}

static void Fls_CacheSetup(void)
{
    /* Disable cache on R2 bank: as S32K148 FlexNVMs region is not cacheable */
    IP_LMEM->PCCRMR &= ~LMEM_PCCRMR_R2_MASK;
}

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
/**
* @brief        Main function of the example
* @details      Initializes IP FTFC driver and erase, write, read internal flash memory
*/
int main(void)
{
    Ftfc_Fls_Ip_StatusType FtfcStatus;
    uint32 Index;

    /* Initialize clock */
    sys_init();

    /* Initialize cache */
    Fls_CacheSetup();

    /* Initialize FTFC driver */
    Ftfc_Fls_Ip_Init(&FtfcConfigSet_BOARD_InitPeripherals_InitCfg);

    /* Initialize buffers */
    Fls_InitBuffers();

    /* Erase sector */
    Ftfc_Fls_Ip_SectorErase(FTFC_SECTOR_ADDR);
    do
    {
        FtfcStatus = Ftfc_Fls_Ip_SectorEraseStatus();
    }
    while (STATUS_FTFC_FLS_IP_BUSY == FtfcStatus);
    Fls_ExampleAssert(STATUS_FTFC_FLS_IP_SUCCESS == FtfcStatus);

    /* Write data */
    for (Index = 0U; Index < FTFC_BUF_SIZE; Index += FTFC_WRITE_DOUBLE_WORD)
    {
        Ftfc_Fls_Ip_Write(FTFC_WRITE_ADDR + Index, &TxBuffer[Index], FTFC_WRITE_DOUBLE_WORD);
        do
        {
            FtfcStatus = Ftfc_Fls_Ip_WriteStatus();
        }
        while (STATUS_FTFC_FLS_IP_BUSY == FtfcStatus);
        Fls_ExampleAssert(STATUS_FTFC_FLS_IP_SUCCESS == FtfcStatus);
    }

    /* Compare the written data */
    FtfcStatus = Ftfc_Fls_Ip_Compare(FTFC_WRITE_ADDR, TxBuffer, FTFC_BUF_SIZE);
    Fls_ExampleAssert(STATUS_FTFC_FLS_IP_SUCCESS == FtfcStatus);

    /* Read data */
    FtfcStatus = Ftfc_Fls_Ip_Read(FTFC_WRITE_ADDR, RxBuffer, FTFC_BUF_SIZE);
    Fls_ExampleAssert(STATUS_FTFC_FLS_IP_SUCCESS == FtfcStatus);

    /* Compare data between Tx and Rx buffer */
    Fls_ExampleAssert(TRUE == Fls_VerifyBuffers());

    /* If we get here it means the test has passed */
    Exit_Example(TRUE);
    return (0U);
}

#ifdef __cplusplus
}
#endif

/** @} */
